Revit 2027 API
LightShape Properties
The LightShape type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
See Also
Reference
LightShape Class
Autodesk.Revit.DB.Lighting Namespace